simplementeUnPorito/Tesis-firmware-psoc/Serial_HAMMER/AcondicionamientoAnalogico.cydsn/Generated_Source/PSoC5/ADC.c
/*******************************************************************************
* File Name: ADC.c
* Version 3.30
*
* Description:
*  This file provides the source code to the API for the Delta-Sigma ADC
*  Component.
*
* Note:
*
********************************************************************************
* Copyright 2008-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "ADC.h"

#if(ADC_DEFAULT_INTERNAL_CLK)
    #include "ADC_theACLK.h"
#endif /* ADC_DEFAULT_INTERNAL_CLK */

#include "ADC_Ext_CP_Clk.h"

#if(ADC_DEFAULT_INPUT_MODE)
    #include "ADC_AMux.h"
#endif /* ADC_DEFAULT_INPUT_MODE */


/***************************************
* Global data allocation
***************************************/

/* Software flag for checking conversion completed or not */
volatile uint8 ADC_convDone = 0u;

/* Software flag to stop conversion for single sample conversion mode
*   with resolution above 16 bits 
*/
volatile uint8 ADC_stopConversion = 0u;

/* To run the initialization block only at the start up */
uint8 ADC_initVar = 0u;

/* To check whether ADC started or not before switching the configuration */
volatile uint8 ADC_started = 0u;

/* Flag to hold ADC config number. By default active config is 1. */
volatile uint8 ADC_Config = 1u;

volatile int32 ADC_Offset = 0;
volatile int32 ADC_CountsPerVolt;


/***************************************
* Local data allocation
***************************************/

/* The array with precalculated gain compensation coefficients */
static ADC_GCOR_STRUCT ADC_gcor[ADC_DEFAULT_NUM_CONFIGS];



/***************************************
* Forward function references
***************************************/
static void ADC_InitConfig(uint8 config) ;
static void ADC_GainCompensation(uint8 inputRange, uint16 idealDecGain, uint16 idealOddDecGain, 
                            uint8 resolution, uint8 config) ;
static void ADC_SetDSMRef0Reg(uint8 value) ;


/******************************************************************************
* Function Name: ADC_Init
*******************************************************************************
*
* Summary:
*  Initialize component's parameters to the parameters set by user in the
*  customizer of the component placed onto schematic. Usually called in
* ADC_Start().
*
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void ADC_Init(void) 
{

    ADC_Config = 1u;
    ADC_convDone = 0u;

    ADC_Ext_CP_Clk_SetMode(CYCLK_DUTY);

    /* This is only valid if there is an internal clock */
    #if(ADC_DEFAULT_INTERNAL_CLK)
        ADC_theACLK_SetMode(CYCLK_DUTY);
    #endif /* ADC_DEFAULT_INTERNAL_CLK */

    #if(ADC_IRQ_REMOVE == 0u)
        /* Set interrupt priority */
        CyIntSetPriority(ADC_INTC_NUMBER, ADC_INTC_PRIOR_NUMBER);
    #endif   /* End ADC_IRQ_REMOVE */

    /* Init static registers with common configuration */
    ADC_DSM_DEM0_REG    = ADC_CF_2V5_DSM_DEM0;
    ADC_DSM_DEM1_REG    = ADC_CF_2V5_DSM_DEM1;
    ADC_DSM_MISC_REG    = ADC_CF_2V5_DSM_MISC;
    ADC_DSM_CLK_REG    |= ADC_CF_2V5_DSM_CLK;
    ADC_DSM_REF1_REG    = ADC_CF_2V5_DSM_REF1;

    ADC_DSM_OUT0_REG    = ADC_CF_2V5_DSM_OUT0;
    ADC_DSM_OUT1_REG    = ADC_CF_2V5_DSM_OUT1;

    ADC_DSM_CR0_REG     = ADC_CF_2V5_DSM_CR0;
    ADC_DSM_CR1_REG     = ADC_CF_2V5_DSM_CR1;
#if(ADC_MI_ENABLE != 0u) /* Enable Modulator Input */
    ADC_DSM_CR3_REG     |= ADC_DSM_MODBIT_EN;
#else
    ADC_DSM_CR3_REG     = ADC_CF_2V5_DSM_CR3;
#endif /* ADC_MI_ENABLE != 0u*/    
    ADC_DSM_CR8_REG     = ADC_CF_2V5_DSM_CR8;
    ADC_DSM_CR9_REG     = ADC_CF_2V5_DSM_CR9;
    ADC_DSM_CR13_REG    = ADC_CF_2V5_DSM_CR13;

    ADC_DEC_SR_REG      = ADC_CF_2V5_DEC_SR;

    /* Calculate Gain compensation coefficients for all configurations */
    ADC_GainCompensation(ADC_CF_2V5_INPUT_RANGE,
                                      ADC_CF_2V5_IDEAL_DEC_GAIN,
                                      ADC_CF_2V5_IDEAL_ODDDEC_GAIN,
                                      ADC_CF_2V5_RESOLUTION,
                                      ADC_CF_2V5);
    #if(ADC_DEFAULT_NUM_CONFIGS > 1)
        ADC_GainCompensation(ADC_CF_0V512_INPUT_RANGE,
                                          ADC_CF_0V512_IDEAL_DEC_GAIN,
                                          ADC_CF_0V512_IDEAL_ODDDEC_GAIN,
                                          ADC_CF_0V512_RESOLUTION,
                                          ADC_CF_0V512);
    #endif /* ADC_DEFAULT_NUM_CONFIGS > 1 */
    #if(ADC_DEFAULT_NUM_CONFIGS > 2)
        ADC_GainCompensation(ADC_CF_1V024_INPUT_RANGE,
                                          ADC_CF_1V024_IDEAL_DEC_GAIN,
                                          ADC_CF_1V024_IDEAL_ODDDEC_GAIN,
                                          ADC_CF_1V024_RESOLUTION,
                                          ADC_CF_1V024);
    #endif /* ADC_DEFAULT_NUM_CONFIGS > 2 */
    #if(ADC_DEFAULT_NUM_CONFIGS > 3)
        ADC_GainCompensation(ADC_CF_0V625_INPUT_RANGE,
                                          ADC_CF_0V625_IDEAL_DEC_GAIN,
                                          ADC_CF_0V625_IDEAL_ODDDEC_GAIN,
                                          ADC_CF_0V625_RESOLUTION,
                                          ADC_CF_0V625);
    #endif /* ADC_DEFAULT_NUM_CONFIGS > 3 */

    /* Set GCOR register for config1 */
    ADC_DEC_GVAL_REG = ADC_gcor[ADC_Config - 1u].gval;
    CY_SET_REG16(ADC_DEC_GCOR_16B_PTR, ADC_gcor[ADC_Config - 1u].gcor);

    /* Initialize the registers with default customizer settings for config1 */
    ADC_InitConfig(ADC_Config);
}


/******************************************************************************
* Function Name: ADC_Enable
*******************************************************************************
*
* Summary:
*  Enables the ADC DelSig block operation.
*
* Parameters:
*  None
*
* Return:
*  None
*
* Side Effects: 
*  Enables internal interrupt.
*
*******************************************************************************/
void ADC_Enable(void) 
{
	uint8 config;
    uint8 enableInterrupts;
    enableInterrupts = CyEnterCriticalSection();

    /* Read volatile variable to the local variable */
    config = ADC_Config;
    
    /* Enable active mode power for ADC */
    ADC_PWRMGR_DEC_REG |= ADC_ACT_PWR_DEC_EN;
    ADC_PWRMGR_DSM_REG |= ADC_ACT_PWR_DSM_EN;

     /* Enable alternative active mode power for ADC */
    ADC_STBY_PWRMGR_DEC_REG |= ADC_STBY_PWR_DEC_EN;
    ADC_STBY_PWRMGR_DSM_REG |= ADC_STBY_PWR_DSM_EN;

