simplementeUnPorito/Tesis-firmware-psoc/Serial_HAMMER/AcondicionamientoAnalogico.cydsn/Generated_Source/PSoC5/ADC.c
    /* Disable PRES, Enable power to VCMBUF0, REFBUF0 and REFBUF1, enable PRES */
    ADC_RESET_CR4_REG |= ADC_IGNORE_PRESA1;
    ADC_RESET_CR5_REG |= ADC_IGNORE_PRESA2;

    ADC_DSM_CR17_REG |= (ADC_DSM_EN_BUF_VREF | ADC_DSM_EN_BUF_VCM);

    /* Code to disable the REFBUF0 if reference chosen is External ref */
    #if (((ADC_CF_2V5_REFERENCE == ADC_EXT_REF_ON_P03) || \
          (ADC_CF_2V5_REFERENCE == ADC_EXT_REF_ON_P32)) || \
         ((ADC_DEFAULT_NUM_CONFIGS > 1) && \
          ((ADC_CF_0V512_REFERENCE == ADC_EXT_REF_ON_P03) ||  \
           (ADC_CF_0V512_REFERENCE == ADC_EXT_REF_ON_P32))) || \
         ((ADC_DEFAULT_NUM_CONFIGS > 2) && \
          ((ADC_CF_1V024_REFERENCE == ADC_EXT_REF_ON_P03) ||  \
           (ADC_CF_1V024_REFERENCE == ADC_EXT_REF_ON_P32))) || \
         ((ADC_DEFAULT_NUM_CONFIGS > 3) && \
          ((ADC_CF_0V625_REFERENCE == ADC_EXT_REF_ON_P03) || \
           (ADC_CF_0V625_REFERENCE == ADC_EXT_REF_ON_P32))))
        if (((config == 1u) &&
            ((ADC_CF_2V5_REFERENCE == ADC_EXT_REF_ON_P03) ||
             (ADC_CF_2V5_REFERENCE == ADC_EXT_REF_ON_P32))) ||
            ((config == 2u) &&
            ((ADC_CF_0V512_REFERENCE == ADC_EXT_REF_ON_P03) ||
             (ADC_CF_0V512_REFERENCE == ADC_EXT_REF_ON_P32))) ||
            ((config == 3u) &&
            ((ADC_CF_1V024_REFERENCE == ADC_EXT_REF_ON_P03) ||
             (ADC_CF_1V024_REFERENCE == ADC_EXT_REF_ON_P32))) ||
            ((config == 4u) &&
            ((ADC_CF_0V625_REFERENCE == ADC_EXT_REF_ON_P03) ||
             (ADC_CF_0V625_REFERENCE == ADC_EXT_REF_ON_P32))))
        {
            /* Disable the REFBUF0 */
            ADC_DSM_CR17_REG &= (uint8)~ADC_DSM_EN_BUF_VREF;
        }
    #endif /* External ref */

    #if (((ADC_CF_2V5_INPUT_RANGE == ADC_IR_VSSA_TO_2VREF) || \
         ((ADC_DEFAULT_NUM_CONFIGS > 1) && \
          (ADC_CF_0V512_INPUT_RANGE == ADC_IR_VSSA_TO_2VREF)) || \
         ((ADC_DEFAULT_NUM_CONFIGS > 2) && \
          (ADC_CF_1V024_INPUT_RANGE == ADC_IR_VSSA_TO_2VREF)) || \
         ((ADC_DEFAULT_NUM_CONFIGS > 3) && \
          (ADC_CF_0V625_INPUT_RANGE == ADC_IR_VSSA_TO_2VREF))))
        if(((config == 1u) &&
            (ADC_CF_2V5_INPUT_RANGE == ADC_IR_VSSA_TO_2VREF) &&
            ((ADC_CF_2V5_REFERENCE != ADC_EXT_REF_ON_P03) &&
             (ADC_CF_2V5_REFERENCE != ADC_EXT_REF_ON_P32))) ||
             ((config == 2u) &&
              (ADC_CF_0V512_INPUT_RANGE == ADC_IR_VSSA_TO_2VREF) &&
             ((ADC_CF_0V512_REFERENCE != ADC_EXT_REF_ON_P03) &&
             (ADC_CF_0V512_REFERENCE != ADC_EXT_REF_ON_P32))) ||
             ((config == 3u) &&
              (ADC_CF_1V024_INPUT_RANGE == ADC_IR_VSSA_TO_2VREF) &&
             ((ADC_CF_1V024_REFERENCE != ADC_EXT_REF_ON_P03) &&
             (ADC_CF_1V024_REFERENCE != ADC_EXT_REF_ON_P32))) ||
             ((config == 4u) &&
              (ADC_CF_0V625_INPUT_RANGE == ADC_IR_VSSA_TO_2VREF) &&
             ((ADC_CF_0V625_REFERENCE != ADC_EXT_REF_ON_P03) &&
             (ADC_CF_0V625_REFERENCE != ADC_EXT_REF_ON_P32))))
        {
            /* Enable the REFBUF1 */
            ADC_DSM_REF0_REG |= ADC_DSM_EN_BUF_VREF_INN;
        }
    #endif /* VSSA_TO_2VREF */
    if(config != 0u)
    {
        /* Suppress compiler warning */
    }

    /* Wait for 3 microseconds */
    CyDelayUs(ADC_PRES_DELAY_TIME);

    /* Enable the press circuit */
    ADC_RESET_CR4_REG &= (uint8)~ADC_IGNORE_PRESA1;
    ADC_RESET_CR5_REG &= (uint8)~ADC_IGNORE_PRESA2;

    /* Enable negative pumps for DSM  */
    ADC_PUMP_CR1_REG  |= ( ADC_PUMP_CR1_CLKSEL | ADC_PUMP_CR1_FORCE );

    /* Enable Modulator Chopping if required */
    ADC_DSM_CR2_REG = ADC_CF_2V5_DSM_CR2;

    /* This is only valid if there is an internal clock */
    #if(ADC_DEFAULT_INTERNAL_CLK)
        ADC_PWRMGR_CLK_REG |= ADC_ACT_PWR_CLK_EN;
        ADC_STBY_PWRMGR_CLK_REG |= ADC_STBY_PWR_CLK_EN;
    #endif /* ADC_DEFAULT_INTERNAL_CLK */

    /* Enable the active and alternate active power for charge pump clock */
    ADC_PWRMGR_CHARGE_PUMP_CLK_REG |= ADC_ACT_PWR_CHARGE_PUMP_CLK_EN;
    ADC_STBY_PWRMGR_CHARGE_PUMP_CLK_REG |= ADC_STBY_PWR_CHARGE_PUMP_CLK_EN;

    #if(ADC_IRQ_REMOVE == 0u)
        /* Clear a pending interrupt */
        CyIntClearPending(ADC_INTC_NUMBER);
        /* Enable interrupt */
        CyIntEnable(ADC_INTC_NUMBER);
    #endif   /* End ADC_IRQ_REMOVE */

    CyExitCriticalSection(enableInterrupts);

}


/*******************************************************************************
* Function Name: ADC_Start
********************************************************************************
*
* Summary:
*  Performs all required initialization for this component and enables
*  the power. It configure all the register the first time it is called.
*  Subsequent calls of the Start function only enable the ADC and turn
*  on the power. If multiple configurations are selected, it will
*  configure the ADC for configuration 1 by default, unless the
*  ADC_SelectConfiguration( ) function has been called to change
*  the default setting.
*
* Parameters:
*  None
*
* Return:
*  None
*
* Global variables:
*  ADC_initVar:  Used to check the initial configuration,
*  modified when this function is called for the first time.
*
* Side Effects: 
*  Enables internal interrupt.
*
*******************************************************************************/
void ADC_Start(void) 
{
    if(ADC_initVar == 0u)
    {
        if(ADC_started == 0u)
        {
            ADC_Init();
        }
        ADC_initVar = 1u;
    }

    /* Enable the ADC */
    ADC_Enable();
}


/*******************************************************************************
* Function Name: ADC_Stop
********************************************************************************
*
* Summary:
*  This function stops and powers down the ADC component and the internal
*  clock if the external clock is not selected. If an external clock is
*  used, it is up to the designer to power down the external clock it
*  required.
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void ADC_Stop(void) 
{
    uint8 enableInterrupts;
    enableInterrupts = CyEnterCriticalSection();

    /* Stop conversions */
    ADC_DEC_CR_REG &= (uint8)~ADC_DEC_START_CONV;
    ADC_DEC_SR_REG |=  ADC_DEC_INTR_CLEAR;

    /* Disable PRES, Disable power to VCMBUF0, REFBUF0 and REFBUF1,
       enable PRES */
    ADC_RESET_CR4_REG |= ADC_IGNORE_PRESA1;
    ADC_RESET_CR5_REG |= ADC_IGNORE_PRESA2;

