simplementeUnPorito/Tesis-firmware-psoc/Serial_HAMMER/AcondicionamientoAnalogico.cydsn/Generated_Source/PSoC5/ADC.c
/*******************************************************************************
* Function Name: ADC_GetResult32
********************************************************************************
*
* Summary:
*  Returns a 32-bit result for a conversion with a result that has a
*  resolution of 8 to 20 bits.
*  This function supports different coherency settings.
*
* Parameters:
*  None
*
* Return:
*  int32: Result of the last ADC conversion.
*
* Global variables:
*  ADC_convDone:  Cleared in single sample mode with resolution
*                              above 16 bits
*
*******************************************************************************/
int32 ADC_GetResult32(void) 
{
    uint32 result;
    uint8 coherency;
    #if (CY_PSOC3)
	    uint16 tmp;
    #endif /* CY_PSOC3 */

    /* Read active coherency configuration */
    coherency = ADC_DEC_COHER_REG & ADC_DEC_SAMP_KEY_MASK;

    if(coherency <= ADC_DEC_SAMP_KEY_LOW)
    {   /*  Use default method to read result registers i.e. LSB byte read at the end*/
        #if (CY_PSOC3)
            result = ADC_DEC_SAMPH_REG;
            if((result & 0x80u) != 0u)
            {   /* Sign extend */
                result |= 0xFF00u;
            }
            result = (result << 8u) | ADC_DEC_SAMPM_REG;
            result = (result << 8u) | ADC_DEC_SAMP_REG;
        #else
            result = CY_GET_REG16(ADC_DEC_SAMPH_16B_PTR);
            result = (result << 16u) | (CY_GET_REG16(ADC_DEC_SAMP_16B_PTR));
        #endif /* CY_PSOC3 */
    }
    else if(coherency == ADC_DEC_SAMP_KEY_MID)
    {   /* Read middle byte at the end */
        #if (CY_PSOC3)
            result = ADC_DEC_SAMPH_REG;
            if((result & 0x80u) != 0u)
            {   /* Sign extend */
                result |= 0xFF00u;
            }
            result = (result << 16u) | (CY_GET_REG16(ADC_DEC_SAMP_16B_PTR));
        #else
            result = CY_GET_REG16(ADC_DEC_SAMPH_16B_PTR);
            result = (result << 16u) | ADC_DEC_SAMP_REG;
            result |=  (uint32)((uint32)ADC_DEC_SAMPM_REG << 8u);
        #endif /* CY_PSOC3 */
    }
    else /*ADC_DEC_SAMP_KEY_HIGH */
    {
        /* Read MSB byte at the end */
        #if (CY_PSOC3)
            result = CY_GET_REG16(ADC_DEC_SAMP_16B_PTR);
			tmp = ADC_DEC_SAMPH_REG;
            if((tmp & 0x80u) != 0u)
            {   /* Sign extend */
                tmp |= 0xFF00u;
            }
            result |= (uint32)tmp << 16u;
        #else
            result = CY_GET_REG16(ADC_DEC_SAMP_16B_PTR);
            result |= (uint32)((uint32)CY_GET_REG16(ADC_DEC_SAMPH_16B_PTR) << 16u);
        #endif /* CY_PSOC3 */
    }
    /* Clear conversion complete status in Single Sample mode with resolution above 16 bit */
    if(ADC_stopConversion != 0u)
    {
        ADC_convDone = 0u;
    }

    return ((int32)result);
}


/*******************************************************************************
* Function Name: ADC_SetOffset
********************************************************************************
*
* Summary:
*  Sets the ADC offset which is used by the functions ADC_CountsTo_uVolts, 
*  ADC_CountsTo_mVolts, and ADC_CountsTo_Volts to subtract the offset from the 
*  given reading before calculating the voltage conversion.
*
* Parameters:
*  int32:  This value is a measured value when the inputs are shorted or 
*          connected to the same input voltage.
*
* Return:
*  None
*
* Global variables:
*  ADC_Offset:  Modified to set the user provided offset. This
*  variable is used for offset calibration purpose.
*
* Side Effects:
*  Affects the ADC_CountsTo_Volts,
*  ADC_CountsTo_mVolts, ADC_CountsTo_uVolts functions
*  by subtracting the given offset.
*
*******************************************************************************/
void ADC_SetOffset(int32 offset) 
{

    ADC_Offset = offset;
}


/*******************************************************************************
* Function Name: ADC_SetGain
********************************************************************************
*
* Summary:
*  Sets the ADC gain in counts per volt for the voltage conversion
*  functions below. This value is set by default by the reference and
*  input range settings. It should only be used to further calibrate the
*  ADC with a known input or if an external reference is used. This
*  function may also be used to calibrate an entire signal chain, not
*  just the ADC.
*
* Parameters:
*  int32: ADC gain in counts per volt.
*
* Return:
*  None
*
* Global variables:
*  ADC_CountsPerVolt:  modified to set the ADC gain in counts
*   per volt.
*
* Side Effects:
*  Affects the ADC_CountsTo_Volts,
*  ADC_CountsTo_mVolts, ADC_CountsTo_uVolts functions
*  supplying the correct conversion between ADC counts and voltage.
*
*******************************************************************************/
void ADC_SetGain(int32 adcGain) 
{
    ADC_CountsPerVolt = adcGain;
}


/*******************************************************************************
* Function Name: ADC_CountsTo_mVolts
********************************************************************************
*
* Summary:
*  Converts the ADC counts output to mVolts as a 16-bit integer. For
*  example, if the ADC measured 0.534 volts, the return value would
*  be 534 mVolts.
*
* Parameters:
*  int32: adcCounts Result from the ADC conversion.
*
* Return:
*  int16:  Result in mVolts
*
* Global variables:
*  ADC_CountsPerVolt:  used to convert ADC counts to mVolts.
*  ADC_Offset:  Used as the offset while converting ADC counts
*   to mVolts.
*
*******************************************************************************/
int16 ADC_CountsTo_mVolts(int32 adcCounts) 
{

    int16 mVolts;

    /* Convert adcCounts to the right align if left option selected */
    #if(ADC_CF_2V5_DEC_DIV != 0)
        if(ADC_Config == ADC_CF_2V5)
        {
            adcCounts /= ADC_CF_2V5_DEC_DIV;
        }
    #endif /* ADC_CF_2V5_DEC_DIV */
    #if((ADC_CF_0V512_DEC_DIV != 0) && (ADC_DEFAULT_NUM_CONFIGS > 1))
        if(ADC_Config == ADC_CF_0V512)
        {
            adcCounts /= ADC_CF_0V512_DEC_DIV;
        }
    #endif /* ADC_CF_0V512_DEC_DIV */
    #if((ADC_CF_1V024_DEC_DIV != 0) && (ADC_DEFAULT_NUM_CONFIGS > 2))
        if(ADC_Config == ADC_CF_1V024)
        {
            adcCounts /= ADC_CF_1V024_DEC_DIV;
        }
    #endif /* ADC_CF_0V512_DEC_DIV */
    #if((ADC_CF_0V625_DEC_DIV != 0) && (ADC_DEFAULT_NUM_CONFIGS > 3))
        if(ADC_Config == ADC_CF_0V625)
        {
            adcCounts /= ADC_CF_0V625_DEC_DIV;
        }
    #endif /* ADC_CF_0V512_DEC_DIV */

    /* Subtract ADC offset */
    adcCounts -= ADC_Offset;

    mVolts = (int16)(( adcCounts * ADC_1MV_COUNTS ) / ADC_CountsPerVolt) ;

    return(mVolts);
}


