simplementeUnPorito/Tesis-firmware-psoc/Serial_HAMMER/AcondicionamientoAnalogico.cydsn/Generated_Source/PSoC5/ADC.c
    return( uVolts );
}


/*******************************************************************************
* Function Name: ADC_InitConfig(uint8 config)
********************************************************************************
*
* Summary:
*  Initializes all registers based on customizer settings
*
* Parameters:
*   void
*
* Return:
*  None
*
* Global variables:
*  ADC_CountsPerVolt:  Used to set the default counts per volt.
*
* Side Effects: Rewrites the coherency set by ADC_SetCoherency()
*   API to the default value.
*
*******************************************************************************/
static void ADC_InitConfig(uint8 config) 
{
    ADC_stopConversion = 0u;

    if (config == 1u)
    {
        /* Default Config */
        ADC_DEC_CR_REG      = ADC_CF_2V5_DEC_CR;
        ADC_DEC_SHIFT1_REG  = ADC_CF_2V5_DEC_SHIFT1;
        ADC_DEC_SHIFT2_REG  = ADC_CF_2V5_DEC_SHIFT2;
        ADC_DEC_DR2_REG     = ADC_CF_2V5_DEC_DR2;
        ADC_DEC_DR2H_REG    = ADC_CF_2V5_DEC_DR2H;
        ADC_DEC_DR1_REG     = ADC_CF_2V5_DEC_DR1;
        ADC_DEC_OCOR_REG    = ADC_CF_2V5_DEC_OCOR;
        ADC_DEC_OCORM_REG   = ADC_CF_2V5_DEC_OCORM;
        ADC_DEC_OCORH_REG   = ADC_CF_2V5_DEC_OCORH;
        ADC_DEC_COHER_REG   = ADC_CF_2V5_DEC_COHER;

        ADC_DSM_CR4_REG     = ADC_CF_2V5_DSM_CR4;
        ADC_DSM_CR5_REG     = ADC_CF_2V5_DSM_CR5;
        ADC_DSM_CR6_REG     = ADC_CF_2V5_DSM_CR6;
        ADC_DSM_CR7_REG     = ADC_CF_2V5_DSM_CR7;
        ADC_DSM_CR10_REG    = ADC_CF_2V5_DSM_CR10;
        ADC_DSM_CR11_REG    = ADC_CF_2V5_DSM_CR11;
        ADC_DSM_CR12_REG    = ADC_CF_2V5_DSM_CR12;
        ADC_DSM_CR14_REG    = ADC_CF_2V5_DSM_CR14;
        ADC_DSM_CR15_REG    = ADC_CF_2V5_DSM_CR15;
        ADC_DSM_CR16_REG    = ADC_CF_2V5_DSM_CR16;
        ADC_DSM_CR17_REG    = ADC_CF_2V5_DSM_CR17;
        /* Set DSM_REF0_REG by disabling and enabling the PRESS circuit */
        ADC_SetDSMRef0Reg(ADC_CF_2V5_DSM_REF0);
        ADC_DSM_REF2_REG    = ADC_CF_2V5_DSM_REF2;
        ADC_DSM_REF3_REG    = ADC_CF_2V5_DSM_REF3;

        ADC_DSM_BUF0_REG    = ADC_CF_2V5_DSM_BUF0;
        ADC_DSM_BUF1_REG    = ADC_CF_2V5_DSM_BUF1;
        ADC_DSM_BUF2_REG    = ADC_CF_2V5_DSM_BUF2;
        ADC_DSM_BUF3_REG    = ADC_CF_2V5_DSM_BUF3;

        /* To select either Vssa or Vref to -ve input of DSM depending on
        *  the input  range selected.
        */
        #if(ADC_DEFAULT_INPUT_MODE)
            #if (ADC_CF_2V5_INPUT_RANGE == ADC_IR_VSSA_TO_2VREF)
                ADC_AMux_Select(1u);
            #else
                ADC_AMux_Select(0u);
            #endif /* ADC_IR_VSSA_TO_2VREF) */
        #endif /* ADC_DEFAULT_INPUT_MODE */

        /* Set the Conversion stop if resolution is above 16 bit and conversion
        *   mode is Single sample
        */
        #if(ADC_CF_2V5_RESOLUTION > 16 && \
            ADC_CF_2V5_CONV_MODE == ADC_MODE_SINGLE_SAMPLE)
            ADC_stopConversion = 1u;
        #endif /* Single sample with resolution above 16 bits. */

        ADC_CountsPerVolt = (int32)ADC_CF_2V5_COUNTS_PER_VOLT;

        ADC_Ext_CP_Clk_SetDividerRegister(ADC_CF_2V5_CP_CLK_DIVIDER, 1u);

        /* This is only valid if there is an internal clock */
        #if(ADC_DEFAULT_INTERNAL_CLK)
            ADC_theACLK_SetDividerRegister(ADC_CF_2V5_ADC_CLK_DIVIDER, 1u);
        #endif /* ADC_DEFAULT_INTERNAL_CLK */

        #if(ADC_IRQ_REMOVE == 0u)
            /* Set interrupt vector */
            (void)CyIntSetVector(ADC_INTC_NUMBER, &ADC_ISR1);
        #endif   /* End ADC_IRQ_REMOVE */
    }

    #if(ADC_DEFAULT_NUM_CONFIGS > 1)
        if(config == 2u)
        {
            /* Second Config */
            ADC_DEC_CR_REG      = ADC_CF_0V512_DEC_CR;
            ADC_DEC_SHIFT1_REG  = ADC_CF_0V512_DEC_SHIFT1;
            ADC_DEC_SHIFT2_REG  = ADC_CF_0V512_DEC_SHIFT2;
            ADC_DEC_DR2_REG     = ADC_CF_0V512_DEC_DR2;
            ADC_DEC_DR2H_REG    = ADC_CF_0V512_DEC_DR2H;
            ADC_DEC_DR1_REG     = ADC_CF_0V512_DEC_DR1;
            ADC_DEC_OCOR_REG    = ADC_CF_0V512_DEC_OCOR;
            ADC_DEC_OCORM_REG   = ADC_CF_0V512_DEC_OCORM;
            ADC_DEC_OCORH_REG   = ADC_CF_0V512_DEC_OCORH;
            ADC_DEC_COHER_REG   = ADC_CF_0V512_DEC_COHER;

            ADC_DSM_CR4_REG     = ADC_CF_0V512_DSM_CR4;
            ADC_DSM_CR5_REG     = ADC_CF_0V512_DSM_CR5;
            ADC_DSM_CR6_REG     = ADC_CF_0V512_DSM_CR6;
            ADC_DSM_CR7_REG     = ADC_CF_0V512_DSM_CR7;
            ADC_DSM_CR10_REG    = ADC_CF_0V512_DSM_CR10;
            ADC_DSM_CR11_REG    = ADC_CF_0V512_DSM_CR11;
            ADC_DSM_CR12_REG    = ADC_CF_0V512_DSM_CR12;
            ADC_DSM_CR14_REG    = ADC_CF_0V512_DSM_CR14;
            ADC_DSM_CR15_REG    = ADC_CF_0V512_DSM_CR15;
            ADC_DSM_CR16_REG    = ADC_CF_0V512_DSM_CR16;
            ADC_DSM_CR17_REG    = ADC_CF_0V512_DSM_CR17;
            /* Set DSM_REF0_REG by disabling and enabling the PRESS cirucit */
            ADC_SetDSMRef0Reg(ADC_CF_0V512_DSM_REF0);
            ADC_DSM_REF2_REG    = ADC_CF_0V512_DSM_REF2;
            ADC_DSM_REF3_REG    = ADC_CF_0V512_DSM_REF3;

            ADC_DSM_BUF0_REG    = ADC_CF_0V512_DSM_BUF0;
            ADC_DSM_BUF1_REG    = ADC_CF_0V512_DSM_BUF1;
            ADC_DSM_BUF2_REG    = ADC_CF_0V512_DSM_BUF2;
            ADC_DSM_BUF3_REG    = ADC_CF_0V512_DSM_BUF3;

            /* To select either Vssa or Vref to -ve input of DSM depending on
            *  the input range selected.
            */

            #if(ADC_DEFAULT_INPUT_MODE)
                #if (ADC_CF_0V512_INPUT_RANGE == ADC_IR_VSSA_TO_2VREF)
                    ADC_AMux_Select(1u);
                #else
                    ADC_AMux_Select(0u);
                #endif /* ADC_IR_VSSA_TO_2VREF) */
            #endif /* ADC_DEFAULT_INPUT_MODE */

            /* Set the Conversion stop if resolution is above 16 bit and
            *   conversion mode is Single sample
            */
            #if(ADC_CF_0V512_RESOLUTION > 16 && \
                ADC_CF_0V512_CONV_MODE == ADC_MODE_SINGLE_SAMPLE)
                ADC_stopConversion = 1u;
            #endif /* Single sample with resolution above 16 bits. */

            ADC_CountsPerVolt = (int32)ADC_CF_0V512_COUNTS_PER_VOLT;

